EasyConNS/EasyMCU_ESP32C61/sdkconfig.defaults.esp32c61
# Test on ESP32-C61-DevKitC-1-N8R2

CONFIG_IDF_TARGET="esp32c61"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# use jtag for transport layer
CONFIG_TRANSPORT_LAYER_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# 15ms is OK, if mbuf memory not released, maybe set to 20ms
CONFIG_HID_REPORT_INTERVAL=15

# FLASH
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_n2c.csv"
